RU/Files/day2_LabWork/cases/t-junction/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 1e-3;

boundaryField
{
    inlet1
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;       // 5% turbulent intensity
        value           uniform 1e-3;
    }

    inlet2
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;       // 5% turbulent intensity
        value           uniform 1e-3;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1e-3;
    }
    
    frontAndBack
    {
	type		empty;
    }

    defaultFaces
    {
        type            kqRWallFunction;
        value           uniform 1e-3;
    }
}

// ************************************************************************* //
