RU/Files/day2_LabWork/cases/t-junction/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//           inlet1
//             +-+
//             | |
//             | |
//             | |
//             | |
// +-----------+ |
// |outlet       |
// +-----------+ |
//             | |
//             | |
//             | |
//             | |
//             +-+
//           inlet2

convertToMeters 1;

vertices
(
    (0.0  -0.01 0)   //0 //0
    (0.2  -0.01 0)       //1
    (0.2   0.01 0)   //2 //2
    (0.0   0.01 0)       //3

    (0.22 -0.01 0)  //4  //4
    (0.22  0.01 0)       //5

    (0.2  -0.21 0)  //6  //6
    (0.22 -0.21 0)       //7

    (0.2   0.21 0)  //8  //8
    (0.22  0.21 0)       //9

    // Z
    (0.0  -0.01 0.02)   //0 //10
    (0.2  -0.01 0.02)       //11
    (0.2   0.01 0.02)   //2 //12
    (0.0   0.01 0.02)       //13

    (0.22 -0.01 0.02)  //4  //14
    (0.22  0.01 0.02)       //15

    (0.2  -0.21 0.02)  //6  //16
    (0.22 -0.21 0.02)       //17

    (0.2   0.21 0.02)  //8  //18
    (0.22  0.21 0.02)       //19

);

blocks
(
    // outlet block
    hex (0 1 2 3  10 11 12 13) (100 20 1) simpleGrading (1 1 1)

    // central block
    hex (1 4 5 2  11 14 15 12) (20 20 1) simpleGrading (1 1 1)

    // bottom block
    hex (6 7 4 1  16 17 14 11) (20 100 1) simpleGrading (1 1 1)

    // top block
    hex (2 5 9 8  12 15 19 18) (20 100 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch outlet
    (
        (0 10 13 3)
    )

    patch inlet1
    (
        (6 7 17 16)
    )

    patch inlet2
    (
        (8 18 19 9)
    )

    empty frontAndBack
    (
	(0 1 2 3)
	(10 11 12 13)
	(1 4 5 2)
	(11 14 15 12)
	(6 7 4 1)
	(16 17 14 11)
	(2 5 9 8)
	(12 15 19 18)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
