RU/Files/day2_LabWork/cases/t-junction/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        tolerance       1e-06;
        relTol          0.01;
        preconditioner	DIC;
    }

    pFinal
    {
        solver          PCG;
        tolerance       1e-06;
        relTol          0;
        preconditioner	DIC;
    }

    "(rho|U|k|omega|epsilon|T)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0;
    }

    "(rho|U|k|omega|epsilon|T)Final"
    {
        $U;
        tolerance       1e-07;
        relTol          0;
    }
}

PISO
{
    nOuterCorrectors 2;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
}


// ************************************************************************* //
